import React from 'react';
import './Promotion.css';

export default function Promotion() {
  return (
    <section className="promotion" id="promotion">
      <h2>В стиле Pin-up отправляйтесь по следам легенд вместе с командой Golden Bay!</h2>
      <p>"Golden Bay: Pirate Quest" — это игра в жанре Поиск Предметов, отправляющая игроков в экспедицию на загадочный остров в стиле Pin-up. Недостающая карта бухты, подводные руины в стиле Pin-up и легендарные Пещеры Сокровищ ждут вас. Команда Golden Bay стремится раскрыть всё — от древних артефактов до историй о пиратском золоте. Головоломки, сюжет и атмосфера исследования объединены — всё в духе приключения в стиле Pin-up!</p>
      <p className="intro">Ключевые особенности игры:</p>
      <ul>
        <li>Ищите скрытые предметы: исследуйте пещеры, побережья и подводные просторы, находите редкие артефакты и тайные уголки.</li>
        <li>Легенды и мифы пиратов: находите связи между обнаруженными предметами и историческими событиями острова.</li>
        <li>Головоломки и взаимодействие: используйте найденные предметы для решения задач и открытия новых локаций.</li>
      </ul>
    </section>
  );
}
